spec/cassettes/cyber_source_credit_card/when_set_on_the_same_payment_method.yml

---
http_interactions:
- request:
    method: post
    uri: https://ics2wstest.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.69">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>1-1411101965</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.44.1</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin12.0</clientEnvironment>
        <billTo>
          <firstName>Tobias</firstName>
          <lastName>Luetke</lastName>
          <street1>123 Some St</street1>
          <city>Eugene</city>
          <state>OR</state>
          <postalCode>97408</postalCode>
          <country>USA</country>
          <email>userNA@hellobar.com</email>
        </billTo>
        <purchaseTotals>
          <currency>USD</currency>
          <grandTotalAmount>0.00</grandTotalAmount>
        </purchaseTotals>
        <card>
          <accountNumber>4111111111111111</accountNumber>
          <expirationMonth>08</expirationMonth>
          <expirationYear>2016</expirationYear>
          <cardType>001</cardType>
        </card>
        <subscription>
          <paymentMethod>credit card</paymentMethod>
        </subscription>
        <recurringSubscriptionInfo>
          <amount>0</amount>
          <frequency>on-demand</frequency>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionCreateService run="true"/>
        <businessRules>
        </businessRules>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - pid=443,requestid=55817d31-913e-4fce-9c8f-30b56c35d049
      Set-Cookie:
      - _op_aixPageId=a_17370b4f-b4bc-4952-bbc9-d54e505b4dcd; Path=/
      Content-Type:
      - text/xml
      Content-Length:
      - '1481'
      Date:
      - Fri, 19 Sep 2014 04:46:05 GMT
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-28578448"><wsu:Created>2014-09-19T04:46:06.159Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.69"><c:merchantReferenceCode>1-1411101965</c:merchantReferenceCode><c:requestID>4111019657950176195995</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>Ahj/7wSRvbe3i5SAP2s2IkHLZo5csWTiiwbw6EajCT+Rj803MBT+Rj803PSACFLDJpJlukB2eJ0Ccje29vFykAftZsAAHxk+</c:requestToken><c:purchaseTotals><c:currency>USD</c:currency></c:purchaseTotals><c:ccAuthReply><c:reasonCode>100</c:reasonCode><c:amount>0.00</c:amount><c:authorizationCode>888888</c:authorizationCode><c:avsCode>X</c:avsCode><c:avsCodeRaw>I1</c:avsCodeRaw><c:authorizedDateTime>2014-09-19T04:46:06Z</c:authorizedDateTime><c:processorResponse>100</c:processorResponse><c:reconciliationID>96499128Q07CPFQB</c:reconciliationID></c:ccAuthReply><c:paySubscriptionCreateReply><c:reasonCode>100</c:reasonCode><c:subscriptionID>4111019657950176195995</c:subscriptionID></c:paySubscriptionCreateReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version:
  recorded_at: Fri, 19 Sep 2014 04:46:06 GMT
- request:
    method: post
    uri: https://ics2wstest.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.69">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>1-1411101966</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.44.1</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin12.0</clientEnvironment>
        <recurringSubscriptionInfo>
          <subscriptionID>4111019657950176195995</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionRetrieveService run="true"/>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - pid=24998,requestid=6292b0c2-cd67-40d1-bd25-327a7da91c30
      Set-Cookie:
      - _op_aixPageId=a_2105147c-2e78-4c04-a4e9-8da90f0de9cb; Path=/
      Content-Type:
      - text/xml
      Content-Length:
      - '1865'
      Date:
      - Fri, 19 Sep 2014 04:46:06 GMT
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-1054573431"><wsu:Created>2014-09-19T04:46:06.671Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.69"><c:merchantReferenceCode>1-1411101966</c:merchantReferenceCode><c:requestID>4111019666340176195842</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhjzbwSRvbe3mtdmL+IEIgKfxusQRg6QAQpYZNJMt0gOzxOANAAAYg2o</c:requestToken><c:paySubscriptionRetrieveReply><c:reasonCode>100</c:reasonCode><c:approvalRequired>false</c:approvalRequired><c:automaticRenew>false</c:automaticRenew><c:cardAccountNumber>411111XXXXXX1111</c:cardAccountNumber><c:cardExpirationMonth>08</c:cardExpirationMonth><c:cardExpirationYear>2016</c:cardExpirationYear><c:cardType>001</c:cardType><c:city>Eugene</c:city><c:country>US</c:country><c:currency>USD</c:currency><c:email>userna@hellobar.com</c:email><c:endDate>99991231</c:endDate><c:firstName>TOBIAS</c:firstName><c:frequency>on-demand</c:frequency><c:lastName>LUETKE</c:lastName><c:paymentMethod>credit card</c:paymentMethod><c:paymentsRemaining>0</c:paymentsRemaining><c:postalCode>97408</c:postalCode><c:startDate>20140919</c:startDate><c:state>OR</c:state><c:status>CURRENT</c:status><c:street1>123 Some St</c:street1><c:subscriptionID>4111019657950176195995</c:subscriptionID><c:totalPayments>0</c:totalPayments><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionRetrieveReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version:
  recorded_at: Fri, 19 Sep 2014 04:46:06 GMT
- request:
    method: post
    uri: https://ics2wstest.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.69">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>1-1411101966</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.44.1</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin12.0</clientEnvironment>
        <billTo>
          <firstName>Tobias</firstName>
          <lastName>Luetke</lastName>
          <street1>123 Some St</street1>
          <city>Eugene</city>
          <state>OR</state>
          <postalCode>97408</postalCode>
          <country>USA</country>
          <email>userNA@hellobar.com</email>
        </billTo>
        <card>
          <accountNumber>4111111111111111</accountNumber>
          <expirationMonth>08</expirationMonth>
          <expirationYear>2017</expirationYear>
          <cardType>001</cardType>
        </card>
        <subscription>
          <paymentMethod>credit card</paymentMethod>
        </subscription>
        <recurringSubscriptionInfo>
          <subscriptionID>4111019657950176195995</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionUpdateService run="true"/>
        <businessRules>
        </businessRules>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - pid=443,requestid=86ab961d-1cc3-48eb-90ea-e753c5622a46
      Set-Cookie:
      - _op_aixPageId=a_2a622c0b-4860-4f42-8e95-a16ddf8a0f05; Path=/
      Content-Type:
      - text/xml
      Content-Length:
      - '1060'
      Date:
      - Fri, 19 Sep 2014 04:46:06 GMT
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-163552589"><wsu:Created>2014-09-19T04:46:07.088Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.69"><c:merchantReferenceCode>1-1411101966</c:merchantReferenceCode><c:requestID>4111019670420176195995</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhizbwSRvbe3okNMFqM2IgKfxQ4561AEKWGTSTLdIDs8TgEwykzp</c:requestToken><c:paySubscriptionUpdateReply><c:reasonCode>100</c:reasonCode><c:subscriptionID>4111019657950176195995</c:subscriptionID><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionUpdateReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version:
  recorded_at: Fri, 19 Sep 2014 04:46:07 GMT
- request:
    method: post
    uri: https://ics2wstest.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.69">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>1-1411101967</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.44.1</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin12.0</clientEnvironment>
        <recurringSubscriptionInfo>
          <subscriptionID>4111019657950176195995</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionRetrieveService run="true"/>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - pid=443,requestid=d5dbaaf2-915e-4402-a0b5-33747c370142
      Set-Cookie:
      - _op_aixPageId=a_89ae7781-19f7-478a-8c32-3ae31e6fd939; Path=/
      Content-Type:
      - text/xml
      Content-Length:
      - '1865'
      Date:
      - Fri, 19 Sep 2014 04:46:06 GMT
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-2105609846"><wsu:Created>2014-09-19T04:46:07.482Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.69"><c:merchantReferenceCode>1-1411101967</c:merchantReferenceCode><c:requestID>4111019674460176195995</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhjzbwSRvbe3qZyRnkM2IgKfv3elJIaQAQpYZNJMt0gOzxOANAAAgQyf</c:requestToken><c:paySubscriptionRetrieveReply><c:reasonCode>100</c:reasonCode><c:approvalRequired>false</c:approvalRequired><c:automaticRenew>false</c:automaticRenew><c:cardAccountNumber>411111XXXXXX1111</c:cardAccountNumber><c:cardExpirationMonth>08</c:cardExpirationMonth><c:cardExpirationYear>2017</c:cardExpirationYear><c:cardType>001</c:cardType><c:city>Eugene</c:city><c:country>US</c:country><c:currency>USD</c:currency><c:email>userna@hellobar.com</c:email><c:endDate>99991231</c:endDate><c:firstName>TOBIAS</c:firstName><c:frequency>on-demand</c:frequency><c:lastName>LUETKE</c:lastName><c:paymentMethod>credit card</c:paymentMethod><c:paymentsRemaining>0</c:paymentsRemaining><c:postalCode>97408</c:postalCode><c:startDate>20140919</c:startDate><c:state>OR</c:state><c:status>CURRENT</c:status><c:street1>123 Some St</c:street1><c:subscriptionID>4111019657950176195995</c:subscriptionID><c:totalPayments>0</c:totalPayments><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionRetrieveReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version:
  recorded_at: Fri, 19 Sep 2014 04:46:07 GMT
- request:
    method: post
    uri: https://ics2wstest.ic3.com/commerce/1.x/transactionProcessor
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
        <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
          <s:Header>
            <wsse:Security s:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
              <wsse:UsernameToken>
                <wsse:Username>hellobar</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">YGxyAaeHOQe2vRoisqdInSI9DE4UEhiOVy5aYpoQewXKcCwF11FZRQncjhOlBU41Qo/MwaQ5vIEMuO/zdFTY+WhXYA8KVgquD2H5mgw/CK470t/oXKHNzzRdfcrYbdChFTloHTSm6TxV/Uo94MzIQSf+38eFYpjkOAei7Fm2esJlm2P3rKCBb10JGMvuE9hJAcJidFJ3qdlw9NzfCEWWzajJ9Wl4/Fc9zRszZ5zbX7oRmCkf/aRDu4nO6gML3wVWj1DkCylLdfYLnbjRFKfF8uHriOo/txJCZRuorM5KkjUTroXAGRq2G40btrXhiQsw4j10Gqa8JJCfM3tvnQoNyg==</wsse:Password>
              </wsse:UsernameToken>
            </wsse:Security>
          </s:Header>
          <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-1.69">
              <merchantID>hellobar</merchantID>
              <merchantReferenceCode>1-1411101967</merchantReferenceCode>
              <clientLibrary>Ruby Active Merchant</clientLibrary>
              <clientLibraryVersion>1.44.1</clientLibraryVersion>
              <clientEnvironment>x86_64-darwin12.0</clientEnvironment>
        <recurringSubscriptionInfo>
          <subscriptionID>4111019657950176195995</subscriptionID>
          <approvalRequired>false</approvalRequired>
        </recurringSubscriptionInfo>
        <paySubscriptionRetrieveService run="true"/>
            </requestMessage>
          </s:Body>
        </s:Envelope>
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache-Coyote/1.1
      X-Opnet-Transaction-Trace:
      - pid=443,requestid=aab6c333-79c9-4523-bc3d-e03d0b88fc75
      Set-Cookie:
      - _op_aixPageId=a_507828c6-7df1-47fd-91f5-026fa8c42082; Path=/
      Content-Type:
      - text/xml
      Content-Length:
      - '1864'
      Date:
      - Fri, 19 Sep 2014 04:46:07 GMT
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-999505941"><wsu:Created>2014-09-19T04:46:07.870Z</wsu:Created></wsu:Timestamp></wsse:Security></soap:Header><soap:Body><c:replyMessage xmlns:c="urn:schemas-cybersource-com:transaction-data-1.69"><c:merchantReferenceCode>1-1411101967</c:merchantReferenceCode><c:requestID>4111019678420176195995</c:requestID><c:decision>ACCEPT</c:decision><c:reasonCode>100</c:reasonCode><c:requestToken>AhjzbwSRvbe3sNCWZ6M2IgKfyMfmm6aQAQpYZNJMt0gOzxOANAAAgQyf</c:requestToken><c:paySubscriptionRetrieveReply><c:reasonCode>100</c:reasonCode><c:approvalRequired>false</c:approvalRequired><c:automaticRenew>false</c:automaticRenew><c:cardAccountNumber>411111XXXXXX1111</c:cardAccountNumber><c:cardExpirationMonth>08</c:cardExpirationMonth><c:cardExpirationYear>2017</c:cardExpirationYear><c:cardType>001</c:cardType><c:city>Eugene</c:city><c:country>US</c:country><c:currency>USD</c:currency><c:email>userna@hellobar.com</c:email><c:endDate>99991231</c:endDate><c:firstName>TOBIAS</c:firstName><c:frequency>on-demand</c:frequency><c:lastName>LUETKE</c:lastName><c:paymentMethod>credit card</c:paymentMethod><c:paymentsRemaining>0</c:paymentsRemaining><c:postalCode>97408</c:postalCode><c:startDate>20140919</c:startDate><c:state>OR</c:state><c:status>CURRENT</c:status><c:street1>123 Some St</c:street1><c:subscriptionID>4111019657950176195995</c:subscriptionID><c:totalPayments>0</c:totalPayments><c:ownerMerchantID>hellobar</c:ownerMerchantID></c:paySubscriptionRetrieveReply></c:replyMessage></soap:Body></soap:Envelope>
    http_version:
  recorded_at: Fri, 19 Sep 2014 04:46:07 GMT
recorded_with: VCR 2.9.0
